import React from "react";
import About from "../about";
import Colors from "../../../static/images/colors.png";
import RGB from "../../../static/images/rgb-colors.jpg";
import HSV from "../../../static/images/hsv-colors.png";
import CMYK from "../../../static/images/cmyk-colors.jpg";
import "./styles.css";

const AboutColors = () => {
    return (
        <About>
            <React.Fragment>
                <div className="about-header">
                    <h3>Колірні моделі</h3>
                </div>
                <hr/>
                <p>
                    <b>Колір</b> - це властивість матеріальних об'єктів, яка сприймається як усвідомлене зорове відчуття та виникає в результаті дії на око потоків видимого електронно-магнітного випромінювання (з довжинами хвиль від 380 до 760 нм).
                </p>
                <p>
                    Той або інший колір «привласнюється» людиною об'єкту в процесі зорового сприйняття цього об'єкту.
                </p>
                <p>
                    Світло сприймається або безпосередньо від джерела, наприклад, від освітлювальних приладів, або як відбиття від поверхонь об'єктів або заломлення при проходженні крізь прозорі і напівпрозорі об'єкти.
                </p>
                <p>
                    Амплітуда, що визначає енергію хвилі, відповідає за яскравість кольору.
                </p>
                <p>
                    Око людини - складна оптична система. Фоторецептори поділяються на два види: палички і колбочки.
                </p>
                <p>
                    Палички є високочутливими елементами і працюють в умовах слабкого освітлення. Вони нечутливі до довжини хвилі і тому не "розрізняють" кольору.
                </p>
                <p>
                    Колбочки, навпаки, "розрізняють" колір.
                </p>
                <p>
                Перехід від одного кольору до іншого здійснюється безперервно, поступово. Кожному кольору співставляється не якась одна довжина хвилі світла, а довжини хвиль, що потрапляють в деякий інтервал значень.
                </p>
                <hr/>
                <div className="color-image">
                    <img alt="color-image" src={Colors}></img>
                </div>
                <hr />
                <p>
                    Призначення колірної моделі - дати засоби опису кольору в межах деякого колірного діапазону, у тому числі і для виконання інтерполяції кольорів.
                </p>
                <p>
                    Існують різні моделі, оскільки із зображенням виконуються різні дії: відображення на екран, видрук на принтер, опрацювання кольорів, перетворення в сірі тони, корекція яскравості, інтенсивності і т.п.
                </p>
                <p>
                    Кожна модель має своє призначення, тобто ефективна для виконання окремих операцій.
                </p>
                <p>
                    Розглянемо апаратно-орієнтовані триколірні моделі <b>RGB</b>, <b>CMY</b> та триатрибутні <b>HSV</b>, <b>HSL</b>.
                </p>
                <hr />

                <div className="color-image">
                    <img alt="color-image" src={RGB}></img>
                </div>

                <h5>RGB</h5>
                <p>Адитивна  модель  кольору  найпростіша  для  розуміння.  Вона  є  досить  штучним  прийомом,  оскільки  продиктована  технологією  виготовлення  електронно-променевих  трубок.</p>
                <p>Це апаратно-орієнтована модель, в якій кольори описуються за допомогою складання трьох базових кольорів – червоного, зеленого, синього – в різних пропорціях.</p>
                <p>Тому модель RGB називають адитивною (від англ. «add» складати, додавати). Кольори також називають колірними каналами моделі RGB.</p>

                <hr />  

                <div className="color-image">
                    <img alt="color-image" src={CMYK}></img>
                </div>

                <h5>CMYK</h5>
                
                <p>Субтрактивна модель використовується для підготовки не екранних, а  друкованих  зображень,  тобто  для  пристроїв,  які  реалізують  принцип поглинання (віднімання) кольорів.</p>
                <p>Друковані зображення відрізняються від екранних зображень тим, що їх бачать не у світлі, що проходить, а у відбитому світлі, оскільки аркуш паперу не випромінює світло.</p>
                <p>Базовими кольорами моделі CMY є кольори, які виходять у результаті віднімання основних кольорів RGB від білого. Звідси назва моделі субтрактивна (від англ. «to subtract» – віднімати).</p>


                <hr />

                <div className="color-image">
                    <img alt="color-image" src={HSV}></img>
                </div>

                <h5>HSV</h5>
                
                <p>Модель HSV створена Елві Смітом к 1978 році. Її зручно представляти у вигляді світлової шестигранної піраміди. При цьому по вертикальній осі відкладається значення V, а відстань від осі до бічної грані в горизонтальному перетині відповідає параметру S (за діапазон зміни цих величин приймається інтервал від нуля до одиниці).</p>
                <p>Точка в центрі відповідає нейтральному кольору мінімальної насиченості (білий, сірий, чорний – це залежить від яскравості). Тобто можна сказати, що кут нахилу вектора визначає відтінок, довжина вектора – насиченість кольору. Величина S змінюється від нуля на осі конуса, до одиниці на його гранях. Значенню V=0 відповідає вершина піраміди (чорний колір), значенню V=1 – основа піраміди; кольори при цьому найбільш інтенсивні.</p>
                <p>Точка з координатами V=1, S=0 – центр основи піраміди (відповідає білому кольору). Проміжні значення координати V при S=0 (тобто на осі піраміди) відповідають сірим кольорами, якщо S=0, то значення відтінку H вважається невизначеним, S=1, якщо точка лежить на бічній грані піраміди.</p>

                <hr />

                <div className="extender">
                    ll
                </div>
            </React.Fragment>
        </About>
    )
}

export default AboutColors;